[
  {
    "id": 1,
    "logo": "/img/logos/frimity.svg",
    "title": "Frimity",
    "description": "Application mobile dédiée à la découverte et à l'organisation d'activités de loisirs, simplifiant la planification de sorties et enrichissant l’expérience utilisateur.",
    "stack": "React Native, Express.js, MongoDB, Docker, Git",
    "date": "Décembre 2024 – Présent",
    "contexte": "En tant que développeur full-stack mobile sur Frimity, j’ai pris la responsabilité de concevoir et déployer de A à Z de nouvelles fonctionnalités : module de géolocalisation des événements, système d’inscription et de billetterie, fil d’actualités personnalisé, et tableau de bord analytique pour les organisateurs. J’ai structuré l’architecture API REST avec Express.js, défini les schémas de données MongoDB pour garantir la cohérence multi-plateforme et mis en place un pipeline CI/CD Docker pour automatiser les builds et les tests sur GitLab CI.",
    "difficultes": "– Optimiser les performances de rendu des listes et cartes sur React Native tout en maintenant un chargement fluide des images et des données géospatiales.\n– Mettre en place une stratégie de cache local et de synchronisation hors-ligne pour permettre la consultation des événements sans connexion, avec résolution automatique des conflits lors de la reconnexion.\n– Gérer les certificats et déploiements différenciés sur App Store & Play Store, en assurant un versioning strict et un rollback rapide en cas de bug critique.\n– Coordonner les releases avec l’équipe UI/UX et les tests automatisés (Jest, Detox) pour réduire les retours imprévus en production.",
    "stackIcons": [
      "/img/svg/icons/logo_react.svg",
      "/img/svg/icons/logo_express.svg",
      "/img/svg/icons/logo_mongodb.svg",
      "/img/svg/icons/logo_docker.svg",
      "/img/svg/icons/logo_git.svg"
    ]
  },
  {
    "id": 2,
    "logo": "/img/logos/trainbuddy.svg",
    "title": "TrainBuddy",
    "description": "Plateforme web et mobile pour accompagner les pratiquants de musculation avec un suivi personnalisé et une gestion intuitive des séances.",
    "stack": "Next.js, Java, Spring Boot, PostgreSQL, Git",
    "date": "Octobre 2024 – Présent",
    "contexte": "Initié comme projet personnel puis adopté en interne, j’ai architecturé TrainBuddy en microservices : back-end Spring Boot exposant des endpoints GraphQL, front-end Next.js avec SSR et SSG pour le SEO, et base PostgreSQL hébergée sur AWS RDS. J’ai défini les workflows d’inscription, la gestion des programmes d’entraînement dynamiques, les notifications par e-mail et push, et un tableau de bord statistique calculant progression, charges et courbes de performance.",
    "difficultes": "– Concevoir un système de calcul des statistiques en temps réel sans surcharger la base de données (partitionnement, indexation, jobs batch périodiques).\n– Assurer la cohérence des données utilisateurs entre web et mobile (authentification JWT, rafraîchissement de token, stratégies SSR/CSR).\n– Implémenter un déploiement blue-green sur AWS Elastic Beanstalk pour garantir zéro temps d’arrêt lors des mises à jour.\n– Équilibrer la granularité des logs et alertes (Prometheus + Grafana) pour détecter rapidement les anomalies de performances sans générer de bruit.",
    "stackIcons": [
      "/img/svg/icons/logo_nextjs.svg",
      "/img/svg/icons/logo_java.svg",
      "/img/svg/icons/logo_spring.svg",
      "/img/svg/icons/logo_postgresql.svg",
      "/img/svg/icons/logo_git.svg"
    ]
  },
  {
    "id": 3,
    "logo": "/img/logos/sopra_steria.svg",
    "title": "Sopra Steria",
    "description": "Application interne OGeP pour la gestion des devis, factures et commandes de la CNAM, utilisée pour centraliser les workflows métiers.",
    "stack": "AngularJS, Java, Spring Boot, SQL, VBA, Git",
    "date": "2022 – 2024",
    "contexte": "En alternance, j’ai rejoint l’équipe en charge de l’application OGeP, déployée chez la CNAM. J’ai participé à l’analyse des besoins métier (ateliers avec les gestionnaires), réécriture de modules legacy en Java/Spring Boot, et modernisation de l’interface AngularJS. J’ai automatisé les rapports financiers via des scripts VBA et intégré ces exports dans la plateforme pour générer des tableaux de bord Excel interactifs destinés aux décideurs.",
    "difficultes": "– Migrer en douceur des routines VBA historiques vers des services Java, tout en garantissant l’absence de régression fonctionnelle.\n– Optimiser des requêtes SQL complexes manipulant de gros volumes de données (>10 millions de lignes), réduire les temps de traitement de plus de 70 % grâce à la réécriture de jointures et à l’ajout d’index.\n– Coordonner les déploiements en environnement multi-sites (DEV, UAT, PROD) avec des scripts Liquibase, en respectant les fenêtres de maintenance imposées par la CNAM.\n– Respecter les normes de sécurité et de confidentialité des données de santé (RGPD, hébergement certifié HDS) lors de chaque mise à jour.",
    "stackIcons": [
      "/img/svg/icons/logo_angular.svg",
      "/img/svg/icons/logo_java.svg",
      "/img/svg/icons/logo_spring.svg",
      "/img/svg/icons/logo_mysql.svg",
      "/img/svg/icons/logo_vba.svg",
      "/img/svg/icons/logo_git.svg"
    ]
  },
  {
    "id": 4,
    "logo": "/img/logos/shift89.svg",
    "title": "Shift89",
    "description": "Plateforme B2B 4Innovation pour accompagner les entreprises dans leurs démarches d’innovation, avec façade marketing et espace client.",
    "stack": "Angular, Azure Logic Apps, SQL Azure, GitHub",
    "date": "2021 – 2022",
    "contexte": "Lors de mon alternance, j’ai développé le front-office marketing sous Angular, intégrant des pages dynamiques de présentation des offres et un configurateur de services. J’ai ensuite pris en charge l’espace client, construisant via Azure Logic Apps des workflows sans-serveur pour gérer les demandes de devis, notifications automatiques et synchronisation avec la base SQL Azure. J’ai collaboré avec l’équipe produit pour fixer les critères UX et les règles métier.",
    "difficultes": "– Créer des connecteurs personnalisés Azure Logic Apps pour interfacer CRM et ERP externes, gérer la latence et la résilience des appels HTTP.\n– Mettre en place un système de rôles et permissions granulaire dans Angular, assurant que chaque profil (admin, client, prospect) ne voie que son périmètre.\n– Assurer la montée en charge de la plateforme lors de campagnes marketing (pics à plusieurs centaines de requêtes/minute) en dimensionnant correctement les App Services et règles de scaling.\n– Documenter le processus CI/CD GitHub Actions et rédiger des guides pour l’équipe QA afin d’uniformiser les tests et déploiements.",
    "stackIcons": [
      "/img/svg/icons/logo_angular.svg",
      "/img/svg/icons/logo_azure.svg",
      "/img/svg/icons/logo_mysql.svg",
      "/img/svg/icons/logo_github.svg"
    ]
  }
]
